export const pNum = '^[0-9]+$'; // только числа
export const pPosNegNum = '^[+-]{0,1}[0-9]+$'; // только числа с "+"\"-"
// только числа с "+"\"-" и ","\"."
export const pPosNegNumDot = '^[+-]{0,1}[0-9]{1,10}[,.]{0,1}[0-9]{0,3}$';
// максимум 3 чиcла до комы и 1 после
export const pNum_3_1 = '^[0-9]{0,3}[,.]{0,1}[0-9]{0,1}$';
// максимум 3 чиcла до комы и 2 после
export const pNum_3_2 = '^[0-9]{0,3}[,.]{0,1}[0-9]{0,2}$';
// максимум 3 числа до комы и 3 после
export const pNum_3_3 = '^[0-9]{0,3}[,.]{0,1}[0-9]{0,3}$';
// максимум 5 чисел до комы и 1 после
export const pNum_5_1 = '^[0-9]{0,5}[,.]{0,1}[0-9]{0,1}$';
// максимум 5 чисел до комы и 2 после
export const pNum_5_2 = '^[0-9]{0,5}[,.]{0,1}[0-9]{0,2}$';
// максимум 2 чисел до комы и 1 после
export const pNum_2_1 = '^[0-9]{0,2}[,.]{0,1}[0-9]{0,1}$';
// формат для теиперетури
export const pTemperature = '^[+-]{0,1}[0-9]{0,2}[,]{0,1}[0-9]{1}$';
//буквы числа + символ - "\"
export const pVINCode_1 = '^[\\а-яА-яa-zA-Z0-9]+$';
//запрещенные символы і,о,І,О
export const pVINCode_2 = '^[^!ioIOіоІО]+$';
//буквы числа
export const pTextNum = '^[а-яА-яa-zA-Z0-9]+$';
//буквы Англ. числа
export const pTextNumLat = '^[a-zA-Z0-9]+$';
